САБ/Documents/СчетФактураВыданный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СчетФактураВыданный</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСчетаФактурыВыставленного</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Авансы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаПлатежноРасчетногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерПлатежноРасчетногоДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НомерДокументаОплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчетаФактурыПродавца</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаДоКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДСДоКорректировки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДСДоКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КорректируемыйСчетФактура</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПлатежноРасчетныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НомерДокументаОплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчетаФактурыНаАванс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаСчетаФактурыНаАванс</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерИсправленияСчетаФактурыНаАванс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаИсправленияСчетаФактурыНаАванс</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

САБ/Enums/ВидСчетаФактурыВыставленного.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидСчетаФактурыВыставленного</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаРеализацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаАванс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

САБ/Documents/ПоступлениеНаРасчетныйСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеНаРасчетныйСчет</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СчетНаОплату</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

САБ/Documents/СчетФактураВыданный/Forms/ФормаДокументаНаРеализацию/Ext/Form/Module.bsl
&НаКлиенте
Процедура саб_ЗаполнитьАвансовымиСчетФактурамиПосле(Команда)
	саб_ЗаполнитьАвансовымиСчетФактурамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура саб_ЗаполнитьАвансовымиСчетФактурамиНаСервере()
	    
	    ДокументыРеализации = Новый Массив;
		Для Каждого Стр Из Объект.ДокументыОснования Цикл
			Если ТИПЗнч(Стр.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				ДокументыРеализации.Добавить(Стр.ДокументОснование);
			КонецЕсли;
		КонецЦикла;
		
		Если ДокументыРеализации.Количество() > 0 Тогда 
			
			Реализация = ДокументыРеализации[0]; 		
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка,
			|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка КАК Ссылка,
			|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ВедомыйДокумент КАК ВедомыйДокумент
			|ИЗ
			|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
			|ГДЕ
			|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ВедомыйДокумент = &Реализация";
			
			Запрос.УстановитьПараметр("Реализация", Реализация);			
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Грузоперевозки = Новый Массив;
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.Грузоперевозка) Тогда
					Грузоперевозки.Добавить(Выборка.Грузоперевозка);
				КонецЕсли;		
			КонецЦикла;
			
			Если Грузоперевозки.Количество() > 0 Тогда			
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка,				
				|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ВедомыйСчет КАК ВедомыйСчет
				|ИЗ
				|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
				|ГДЕ
				|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка В(&Грузоперевозки)
				|	И CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ВедомыйСчет <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)";
				
				Запрос.УстановитьПараметр("Грузоперевозки", Грузоперевозки);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Выборка = РезультатЗапроса.Выбрать();
				Счета = Новый Массив;
				Пока Выборка.Следующий() Цикл
					Счета.Добавить(Выборка.ВедомыйСчет);
				КонецЦикла;
				
				Если Счета.Количество() > 0 Тогда
					//поступления ДС до реализации					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка КАК Ссылка
					|ИЗ
					|	Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
					|ГДЕ
					|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СчетНаОплату В(&Счета)
					|	И ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.Дата < &Дата";
					
					Запрос.УстановитьПараметр("Счета", Счета);					
					Запрос.УстановитьПараметр("Дата", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реализация,"Дата"));
					
					РезультатЗапроса = Запрос.Выполнить();
					
					Выборка = РезультатЗапроса.Выбрать();
					
					Поступления = Новый Массив;
					Пока Выборка.Следующий() Цикл
						Поступления.Добавить(Выборка.Ссылка);
					КонецЦикла; 					
					
					Если Поступления.Количество() > 0 Тогда
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	СчетФактураВыданный.Ссылка КАК Ссылка,
						|	СчетФактураВыданный.Номер КАК Номер,
						|	СчетФактураВыданный.Дата КАК Дата
						|ИЗ
						|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
						|ГДЕ
						|	СчетФактураВыданный.ВидСчетаФактуры = &ВидСчетаФактуры
						|	И СчетФактураВыданный.ДокументОснование В(&ДокументОснование)
						|
						|УПОРЯДОЧИТЬ ПО
						|	Дата";
					
					    Запрос.УстановитьПараметр("ДокументОснование", Поступления);
						Запрос.УстановитьПараметр("ВидСчетаФактуры", Перечисления.ВидСчетаФактурыВыставленного.НаАванс);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						Таблица = РезультатЗапроса.Выгрузить();
						
						Если Таблица.Количество() > 0 Тогда
							Для Каждого Стр Из Таблица Цикл
								УжеДобавлено = Ложь;
								Для Каждого СтрокаТабличнойЧасти Из Объект.ПлатежноРасчетныеДокументы Цикл
									Если Стр.Номер = СтрокаТабличнойЧасти.НомерСчетаФактурыНаАванс И Стр.Дата = СтрокаТабличнойЧасти.ДатаСчетаФактурыНаАванс Тогда
										УжеДобавлено = Истина;
										Прервать;
									КонецЕсли;	
								КонецЦикла;
								ДобавленоВТЧ = Ложь;
								Если Не УжеДобавлено Тогда
									Для Каждого СтрокаТабличнойЧасти Из Объект.ПлатежноРасчетныеДокументы Цикл
										Если ПустаяСтрока(СтрокаТабличнойЧасти.НомерСчетаФактурыНаАванс) Тогда
											 СтрокаТабличнойЧасти.НомерСчетаФактурыНаАванс = Стр.Номер;
											 СтрокаТабличнойЧасти.ДатаСчетаФактурыНаАванс = Стр.Дата;
											 ДобавленоВТЧ = Истина;
											 Модифицированность = Истина;
											 Прервать;
										 КонецЕсли;
									 КонецЦикла;
								 КонецЕсли;
								 Если Не ДобавленоВТЧ Тогда 
									 НовСтр = Объект.ПлатежноРасчетныеДокументы.Добавить();								
									 НовСтр.НомерСчетаФактурыНаАванс = Стр.Номер;
									 НовСтр.ДатаСчетаФактурыНаАванс = Стр.Дата;
									 Модифицированность = Истина;
								 КонецЕсли;
							КонецЦикла;	
						КонецЕсли;						
					КонецЕсли;					
				КонецЕсли;				
			КонецЕсли;	
		КонецЕсли;

КонецПроцедуры
